/*****************************************************************************
 * File: main.h
 * Title: GPIOの制御を行うプロジェクトです。
 * LastUpdated: 2025.05.23
 * Copyright (C) 2025 DATA TECNO Co., Ltd.
******************************************************************************/

/**
 * @file main.h
 * @dir GPIO
 * @brief GPIOの制御を行うプロジェクトです。
 * @details 
 * 1. 動作クロック等の基本設定や電源保持機能の初期化を行います。
 * 2. Sw、フォトカプラ入力のポーリング。
 * @note 
 * Sw2を押すとLED1が点灯します。\n
 * Sw3を押すとLED2が点灯します。\n
 * Sw4を押すとLED3が点灯します。\n
 * フォトカプラ0への入力がリレー0に出力されます。\n
 * フォトカプラ1への入力がリレー1に出力されます。\n
 * Sw1の1を押すと5Vレギュレータを起動します。\n
 * Sw1の2を押すと24Vレギュレータを起動します。\n
 */

#ifndef MAIN_H__
#define MAIN_H__
#endif //MAIN_H__
