/*****************************************************************************
 * File: main.h
 * Title: UARTで通信を行うプロジェクトです。
 * LastUpdated: 2025.06.02
 * Copyright (C) 2025 DATA TECNO Co., Ltd.
******************************************************************************/
/**
 * @file main.h
 * @dir Uart
 * @brief UARTで通信を行うプロジェクトです。
 * @details
 * 1. 動作クロック等の基本設定や電源保持機能の初期化を行います。
 * 2. 10文字を受信するまで待機します。
 * 3. 受信後、受信したデータを送信します。
 * @note 通信設定は以下の通りです。\n
 * ボーレート: 9600\n
 * ビット長: 8\n
 * ストップビット: 1\n
 * パリティビット: なし\n
 */
#ifndef MAIN_H__
#define MAIN_H__
#endif //MAIN_H__
